 [
  {
  "Name": "Ami Ehlenberger",
  "Bio": "Ami Ehlenberger is the Vice President of Solution Development for Comcast’s Enterprise Business Intelligence team. In this role, she leads the design, development and operations of a breadth of data solutions from traditional datamarts to our Next Best Action solutions, as well as overseeing the AI/ML team. She is focused on xFinity Consumer Services trends, behaviors and insights.  Prior to Comcast, Ami was an executive at IBM for over 20 years. Her background includes development, support, AI/ML and consulting services. She is from the Philadelphia area and, when not working, enjoys spending her time with her husband and two daughters.",
  "Image": "aehlenberger.png",
  "Designation": "Vice President Solution Development, Comcast"
  },
  {
  "Name": "Aubrey Hochstuhl",
  "Bio": "Aubrey Hochstuhl is a leader in PwC’s Marketing, Sales and Service Transformation team in the U.S. In this role, she works with cable clients to accelerate investments that drive new growth and help transform digital, sales and operations within consumer and business segments. Aubrey works at the intersection of business and tech-enabled solutions to drive innovative client solutions that accelerate velocity of lead to cash activities delivering an enhanced customer experience. She has a passion for developing emerging leaders and a focus on building diverse teams to deliver value for her clients.",
  "Image": "ahochstuhl.png",
  "Designation": "Consulting Director, PWC"
  },
  {
  "Name": "Barbara Eckman",
  "Bio": "Barbara Eckman is a Senior Principal Software Architect at Comcast and a recognized innovator in Big Data architecture and governance. She leads data discovery and lineage platform architecture for a division-wide initiative comprising streaming, transforming, storing and analyzing Big Data. Barbara is also the Lead Metadata Architect for the Comcast Privacy Program, an initiative tackling the challenge of legislation like the California Consumer Privacy Act. Her prior experience includes scientific data and model integration at the Human Genome Project, Merck, GlaxoSmithKline and IBM, where she served on the peer-elected IBM Academy of Technology.",
  "Image": "beckman.png",
  "Designation": "Sr. Principal Architecture, Comcast"
  },
  {
  "Name": "Bryan Kerl",
  "Bio": "Bryan Kerl is the Executive Director of Cyber Services at TechTrueUp. He is an experienced Sales and Marketing Executive and hands-on P&L manager who specializes in building Information Security startups. He has created several business platforms from zero to $20 million, operated businesses up to $250 million and lead turnarounds at $1+ billion companies, including achieving significant business results at four public companies. Bryan is acknowledged as a driving force for developing enterprise market strategies and channel partner alliances. His industry domain expertise covers Information Security, IoT, AI and Behavorial Analytics. He holds a B.S. in Computer Science and Business Administration from Northeastern University.",
  "Image": "bkerl.png",
  "Designation": "Executive Director of Cyber Services, TechTrueUp"
  },
  {
  "Name": "Cara Petonic",
  "Bio": "Cara Petonic is Senior Director of Digital Transformation for the myExperience Team at Comcast. As part of an overarching digital transformation, Cara leads process, policy and technology changes for Talent Acquisition, accounting for more than 1M applications each year.  Previously, Cara served as Director of Corporate Strategy for Comcast where she focused on growth strategy and was a Strategy Consultant with Accenture. She started her career at Janney Montgomery Scott, executing transactions in investment banking totaling more than $1.5B, and covering research on eCommerce stocks. Cara holds an M.B.A. from Cornell University and a B.A. from Bryn Mawr College.",
  "Image": "cpetonic.png",
  "Designation": "Experience Champion, Comcast"
  },
  {
  "Name": "Courtney Goldstein",
  "Bio": "Courtney Goldstein is the Senior Vice President, Digital Sales, Marketing and Media for Comcast. In this role, she leads eCommerce across internet, video, home phone, home security and Xfinity Mobile for both Residential and Business customers. Courtney also manages marketing within the digital sales and self-service experiences, and oversees digital media strategy across search engines. Prior to joining Comcast, she held numerous positions at American Express, most recently serving as Vice President of Consumer Card Acquisition and Early Tenure Card Marketing. Courtney holds a bachelor's degree from the Wharton School at the University of Pennsylvania and an M.B.A. from Columbia University.",
  "Image": "cgoldstein.png",
  "Designation": "SVP, Digital Sales & Marketing, Comcast"
  },
  {
  "Name": "Cynthia Bean",
  "Bio": "As Executive Director, Consumer Insights and Analytics for the Mobile Division of Comcast, Cindy Bean has responsibility for designing, executing and leading the insights and analytics function, which she built from the ground up, after joining Comcast over three years ago. She has been building her insights career since graduating from Drexel University. She started in financial services with The Vanguard Group, while earning her MBA at Penn State University. She continued to lead insights while working on some of the world’s strongest brands: McNeil Consumer Healthcare; Wyeth Pharmaceuticals; Johnson & Johnson’s Vision Care; Campbell’s Soup Company; and currently Comcast.",
  "Image": "cbean.png",
  "Designation": "Executive Director, Consumer Insights and Analytics for the Mobile Division, Comcast"
  },
  {
  "Name": "Danielle Cohn",
  "Bio": "Danielle Cohn is the Head of Comcast NBCUniversal LIFT Labs. She and her team help talented entrepreneurs access to Comcast’s network of partners, brands and mentors to foster rapid breakthroughs in connectivity, media and entertainment. Prior to joining Comcast, she was Vice President of Marketing and Communications for the Philadelphia Convention & Visitors Bureau for more than a decade. A Temple University journalism graduate, Danielle was inducted into the Philadelphia Public Relations Association Hall of Fame, named one of the 40 Under 40 to watch by the Philadelphia Business Journal, and on the list of 101 Emerging Connectors named by Leadership Philadelphia.",
  "Image": "dcohn.png",
  "Designation": "Head of Comcast NBCUniversal LIFT Labs"
  },
  {
      "Name": "Danish Dhamani",
      "Bio": "Danish Dhamani is co-founder and CEO of Orai, an artificial intelligence speech coach that helps individuals and teams deliver effective presentations and sound more confident (featured in FastCompany, TechCrunch and Wired). Danish believes that improving a team's communication skills has the potential to unleash their hidden innovation. When he isn’t glued to a computer screen, Danish spends time cycling, playing squash and trying very hard not to lose focus while meditating.",
      "Image": "ddhamani.png",
      "Designation": "Co-Founder and CEO, Orai"
  },
  {
      "Name": "Donna Ross",
      "Bio": "Donna L. Ross is Radian's Senior Vice President, Chief Information Security Officer. In this role, she is responsible for information security program and business compliance, as well as the enterprise project management and initiative governance programs. Donna is a senior security and compliance executive with over 20 years of diverse risk, compliance, cyber security, technology and operations experience within the manufacturing, insurance, banking, financial services, health care and retail sectors. She received a bachelor’s degree from State University of New York at Brockport in Economics/Business Administration with Marketing specialty and has received numerous technical and security certifications.",
      "Image": "dross.png",
      "Designation": "Chief Information Security Officer, Radian Group"
  },
  {
      "Name": "Fee Vu",
      "Bio": "As a Director at pureIntegration, Fee Vu oversees engagements that deliver high-quality solutions to organizations at the best possible value. With 20 years of technology consulting experience, Fee has helped solve critical problems for startup and Fortune 50 enterprises. His areas of expertise span encompass multiple technologies, including:\n\nArtificial Intelligence: Led teams of data scientists, data architects and software engineers to implement predictive analytics.\n\nApplication Performance Management: Managed large teams to develop monitoring capability at a Fortune 50 Enterprise.\n\nSoftware Development: Implemented custom solutions ranging from web to mobile applications.\n\nPrior to joining pureIntegration, Fee spent five years with Accenture and two years with Deloitte & Touche.",
      "Image": "fvu.png",
      "Designation": "Head of AI/ML Practice, Pure Integration"
  },
  {
      "Name": "Fei Wan",
      "Bio": "Fei Wan is a principal architect in Comcast. She works with teams to deliver product better, faster and more cost efficiently. Before this role, she transformed the QAM VOD backend delivery to 100% IP and launched MPEG4 with in house development and open source technology. She looks at the big picture to determine inter-dependencies and helps teams driving to the solution most likely to succeed. Before joining Comcast, Fei was the principal architect at Music Choice. She delivered Music Choice Widget on Verizon, interactive broadcast TV SWRV etc. Fei has a master's degree in electrical engineering from Iowa State University.",
      "Image": "fwan.png",
      "Designation": "Sr. Principal Architecture, Comcast"
  },
  {
      "Name": "Grace Brevart",
      "Bio": "Grace Brevart has been a Senior Manager at Comcast in the Xfinity Home Business Unit since April 2018. She leads the analytics and reporting function for Xfinity Home, supporting areas such as care and technician operations, sales, customer retention, product reliability and product engagement. Prior to working at Comcast, Grace spent six years at Chase Bank in Wilmington, DE in marketing and operational analytics roles. She holds a bachelor’s degree from Elon University, and a master’s in Business Analytics from Drexel University. Grace lives in Philadelphia with her husband where they enjoy exploring the city and all it offers.",
      "Image": "gbrevarts.png",
      "Designation": "Sr. Manager at Comcast Xfinity Home, Comcast"
  },
  {
  "Name": "Hetal Vora",
  "Bio": "Hetal Vora currently works as an Architect-Mobility for Cognizant Technology Solutions. She has over 12 years of experience in the IT industry. Hetal started out in 2006 as a web developer working mainly on ColdFusion, and mobile apps are what she loves doing now. She started working on iOS in 2009 and has developed app store and enterprise apps for her clients. Hetal also works on hybrid app development. She currently focuses on enterprise mobile apps for Comcast. In her spare time, she enjoys traveling, photography and blogging.",
  "Image": "hvora.png",
  "Designation": "Architect - Mobility, CTS"
  },
  {
  "Name": "Himalay Khimani",
  "Bio": "Himalay Khimani is a Manager of Talent Intelligence and has been at Comcast for over four years. His team is responsible for all talent reporting and dashboards-related initiatives. His other roles at Comcast comprised of working in the HR Operations and HR Analytics teams. Previously, he worked at Goldman Sachs in their Talent Operations organization, focused on implementing talent systems along with improving talent processes. He has a unique trifecta of knowledge pertaining to HR systems, HR processes and HR analytics. Himalay likes to spend time with his almost 1-year old son and avidly follows tech blogs.",
  "Image": "hkhimani.png",
  "Designation": "Manager, Talent Intelligence, Comcast"
  },
  {
  "Name": "Ibrahim (Abe) Baggili",
  "Bio": "Ibrahim (Abe) Baggili is the Elder Family Endowed Chair of Computer Science & Cybersecurity at the University of New Haven’s Tagliatela College of Engineering. He serves as the Assistant Dean and is the founder of the University’s Cyber Forensics Research and Education Group. Abe is also the former editor-in-chief of the Journal of Digital Forensics, Security and Law. His research interests include cybersecurity and forensics from technical, social and psychological perspectives. He has published work on real challenges facing cybercriminal investigators and has presented at conferences worldwide. Abe received his B.Sc., M.Sc. and Ph.D. from Purdue University.",
  "Image": "ibaggili.png",
  "Designation": "Elder Family Endowed Chair of Computer Science & Cybersecurity, University of New Haven"
  },
  {
  "Name": "Jacquelyn Smith",
  "Bio": "As part of Comcast Cable’s Technology, Product & Experience Organization, Jacquelyn Smith is Executive Director, Enterprise Solutions. Her current responsibilities include leading and management of the OASIS - Optimizing Applications Strategy Integrations & Support team, implementation and management of enterprise support tools and financial management of the application systems. Jacquelyn’s team is responsible for the lifecycle of these applications including design, development and deployment across various Comcast lines of Business. Some of these applications include, Slack, Salesforce, JIRA, Confluence, Rally, Github, Nexus etc. Jacquelyn has 20+ years of experience in operations, applications and program management. Jacquelyn has been with Comcast for ~13 years and previously held the positions of Sr. Director, Platform Technologies, Director, Software and Platform Engineering, Product Engineering and Sr. Manager, Program Planning & Project Management in Comcast’s Quality Assurance team. Prior to working at Comcast, Jacquelyn worked as Assistant Director of IT at Hunter College in New York City and as Manager, Network Services, Operations & Program Management with Flextronics, in Dallas Texas. Jacquelyn served as the 2016, National Liaison for the Comcast Women’s Network, supporting national program development. Jacquelyn is also a member of the Comcast Employee Resource Groups. Jacquelyn lead the Comcast NE&TO Women’s forum in 2012/2013 and the Product Engineering Women’s Forum in 2010 /2011 and has severed on the NE&TO Inclusion team from 2010-2014. Jacquelyn has volunteered time with Women in Cable Telecommunications (WICT), a national non-profit organization that has been serving women in the cable industry for 30 years. Jacquelyn is currently serving on the WICT Philadelphia Board of Directors, as an Executive Champion and in 2016, 2017 & 2018 as the Chapter Relations Chair. In 2015 Jacquelyn was the Special Events Chair, focusing on Tech It Out & WICT Philly Gives Back. In 2015 Jacquelyn received the honor of being WICT Philadelphia’s Communicator of the Year award recipient. Jacquelyn has also served as the 2012, 2013 & 2014 Co-Chair for Special Events, the Director of Volunteer Outreach for 2010 & 2011. In 2010, Jacquelyn was selected to participate in WICT’s Rising Leaders Program. Jacquelyn has also served as the Emerging Leader on the 2013 WICT National Board, focusing on Tech IT Out and STEM initiatives.",
  "Image": "jsmith.png",
  "Designation": "WICT Executive Champion, Comcast"
  },
  {
  "Name": "Jennifer Kurtz",
  "Bio": "Jen Kurtz is the Chief Technology Officer at Vertex, responsible for all commercial software development, as well as aligning the technology vision and direction of Vertex solutions with the business strategy. Previously, Jen served as a lead member of the software development and commercial enterprise architecture teams. Prior to joining Vertex, she was a software engineer and developer at Verizon and Platinum Technology respectively. Jen is a member of the Women's Leadership Forum and holds a Master of Science in Computer Science from Villanova University and a B.S. in Computer Science from Bloomsburg University of Pennsylvania.",
  "Image": "jkurtz.png",
  "Designation": "Chief technology Officer, Vertex"
  },
  {
  "Name": "John Weisman",
  "Bio": "John Wiseman has a Bachelor of Science in Electrical Engineering from the University of Massachusetts and a Master of Science in Electrical Engineering from the University of New Mexico. He has 30+ years of experience working in video-related technologies such as PCs and workstations, aircraft avionics, computer graphics, HDTV, set-top boxes and video headend equipment. His current position is Senior Director of Headend Engineering at CommScope in Horsham, PA where he leads a team of approximately 100 engineers in Horsham, San Diego, and Bangalore in the architecture, development, testing, and manufacturing support of cable and internet video equipment.",
  "Image": "jwiseman.png",
  "Designation": "Sr. Director of Headend Engineering, CommScope"
  },
  {
  "Name": "Josée Poirier",
  "Bio": "Josée Poirier is a data scientist at Pluralsight and part-time lecturer at Northeastern University. She uses data, tech, rigorous research, machine learning and visualizations to build a strong evidence base that enhances understanding, informs decision-making, demonstrates impact, inspires trust and persuades stakeholders. Josée is dedicated to helping people and making this world a better place. Together with innovators, she builds products and services that are customized, engaging, wide-reaching, cost-efficient and effective. She aims to advance social causes, demand accountability, increase learnings and improve implementations.",
  "Image": "jpoirier.png",
  "Designation": "Data Scientist, Pluralsight"
  },
  {
  "Name": "Joshua Marpet",
  "Bio": "Joshua Marpet is an accomplished speaker, long time information and physical security practitioner, as well as a startup CEO and serial entrepreneur. He has presented on topics ranging from Facial Recognition to National Security, to audiences from government agencies, law enforcement, Fortune 5 companies and many others. His research encompasses Digital Forensics, business security maturity and how not to start an information security business. Josh is a co-director of Security BSides Delaware, and was on the board of Hackers For Charity, BSidesLV and the Cloud Security Alliance, Delaware Valley chapter. Currently, he’s the COO of Red Lion, LLC.",
  "Image": "jmarpet.png",
  "Designation": "COO, Red Lion"
  },
  {
  "Name": "Juliet Abruzzese",
  "Bio": "Juliet Abruzzese is a Manager of Talent Acquisition at Comcast. Her team supports almost 500 annual hires for the Xfinity Consumer Services organization. Juliet's varied background in talent acquisition spans from recruitment outsourcing to retained executive search. When not at work, she is at home in Bucks County with her husband and small children – gardening, running and cooking for friends. Ask her about her morning “Rocky” run!",
  "Image": "jabruzzese.png",
  "Designation": "Manager of Talent Acquisition, Comcast"
  },
  {
  "Name": "Karen Pfeifer",
  "Bio": "Karen Pfeifer joined Comcast, XCS EBI in 2013 as Sr. Director of Viewing Insights and then expanded her role to be Sr. Director of Product Engagement including digital and viewing on the Data Management team. She leverages big data platforms and analytic tools to transform product engagement events and metadata into trusted and accessible data products and assets. Prior to joining Comcast, Karen directed an audience measurement data product team for DIRECTV over the course of nine years.  Karen received a B.A. in Music from UCLA and holds certifications in business management and technology from Loyola Marymount University and UCLA. Karen just completed her Master of Science degree in Analytics – Data Science from Saint Joseph’s University.",
  "Image": "kpfeifer.png",
  "Designation": "Sr. Director of Viewing Insights, Comcast"
  },
  {
  "Name": "Luci Rainey",
  "Bio": "Luci Rainey is Sr. Vice President of Consumer Marketing and MarTech at Comcast’s Headquarters Office in Philadelphia.  In her current role, she oversees corporate marketing strategy development and implementation for various programs that affect new customer acquisition, customer management and loyalty, new product marketing, home security and the like.  She is also responsible for strategy and development of Comcast’s mar tech platforms which include CRM, campaign analytics and other marketing tools and technologies designed to make marketing to customers more targeted, cost effective and efficient.\n\nAs a leader she has a passion for talent development and marketing education. Her free time passions include travel abroad, cooking, reading and generally experiencing new things. She is also training currently to be an executive coach. She is also a 2017 Betsy Magness Graduate.\n\nLuci currently lives in Wallingford, PA with her two children.",
  "Image": "lrainey.png",
  "Designation": "SVP, Consumer Marketing, Comcast"
  },
  {
  "Name": "Mark Francisco",
  "Bio": "Mark Francisco is a Comcast Fellow, inventor, and veteran of aerospace and cellular industries. He brings new science to Philadelphia as a part of Comcast Labs. Mark is a lifelong New Jersey resident.",
  "Image": "mfrancisco.png",
  "Designation": "Comcast Fellow, Comcast"
  },
  {
  "Name": "Matt Tinney",
  "Bio": "Matt Tinney is the founder and CEO of Windows Management Experts, a solution integrator for Microsoft infrastructure, cloud and security solutions. He enjoys working with new technology and creating innovative solutions that will save his clients time and money. Matt is passionate and open-minded, and believes in getting to the heart of what matters. He takes the time to listen and focus on the quality of the entire customer experience.",
  "Image": "mtinney.png",
  "Designation": "Founder and CEO, Windows Management Experts, Inc."
  },
  {
  "Name": "Maxwell Henderson",
  "Bio": "Max Henderson serves in a variety of roles to help QxBranch grow. He helps support projects involving quantum computation, machine learning and data science. Prior to joining QxBranch, Max held Data Scientist positions at JPMorgan Chase & Co. and Lockheed Martin, providing technical solutions in cyber, bioinformatics and natural language processing domains. He holds a Ph.D. and M.S. from Drexel University in Physics, and a B.S. in Physics from West Chester University.",
  "Image": "mhenderson.png",
  "Designation": "Senior Data Scientist, QxBranch"
  },
  {
  "Name": "Michael J. Riesen M.S.E., J.D.",
  "Bio": "Michael Riesen is a Partner at the international law firm of Smith, Gambrell & Russell, LLP (SGR) where his practice focuses on intellectual property in various technical areas, including cable/telecom technology. He also partnered with Indhira LaPuma (Counsel at SGR) to launch SGR Labs, an initiative combining emerging technology and the delivery of legal services. Michael graduated with a B.S. in Physics from Clarion University of Pennsylvania and obtained a master’s in Engineering from the University of Toledo, with a focus in Artificial and Machine Learning. Michael obtained his J.D. from University of Toledo College of Law, cum laude.",
  "Image": "mriesen.png",
  "Designation": "Partner, SGR Labs / Smith Gambrell and Russell, LLP"
  },
  {
  "Name": "Michele Corsini",
  "Bio": "As part of Comcast Cable's Technology, Product & Experience Organization, Michele Corsini serves as the Senior Director of Solution Management.  Michele is a seasoned Telecommunications Business and Technology leader with 20 years of experience crafting solutions across an array of products, services and technology stacks. Michele has been an active member of Women in Cable Telecommunications (WICT) since 2011. She is a WICT Greater Philadelphia Chapter Board member and currently serves as the Tech It Out Director. When not immersed in data, Michele enjoys spending time with her husband, four children and two dogs.",
  "Image": "mcorsini.png",
  "Designation": "Co-Director WICT Tech It Out, Senior Director, Comcast"
  },
  {
  "Name": "Mylei Saltares",
  "Bio": "Mylei Saltares is currently a Sr. Recruiter at Comcast NBCU with over 10 years of experience specializing in recruitment of technology professionals. For the past four years, Mylei has supported the Cybersecurity team hiring over 70+ employees annually. She is heavily involved in several Talent Acquisition projects such as the revamp of the Technology Employee Referral Program.  Prior to Comcast, Mylei supported the federal sector of Verizon Communications where she was responsible for the end to end recruitment cycle and hiring of cybersecurity professionals with top level clearances for government contracts. Mylei received her Bachelor of Arts degree in Communications from Bloomsburg University and is currently enrolled in their M.B.A. program. Mylei currently resides in Center City, Philadelphia.",
  "Image": "msaltares.png",
  "Designation": "Recruiter, Comcast"
  },
  {
  "Name": "Nuno Leal",
  "Bio": "Nuno Leal works as a Management Consultant in EY. He has extensive experience advising companies in the Telecom, Technology and Media industries. Prior to his experience in the U.S., Nuno started his career in Marketing at Microsoft in Europe. He then shifted to work in consulting across three different continents- focusing on supporting companies to think about the business implications of new emerging technologies. Nuno is passionate about Data Privacy and its broader implications in people’s lives and in shaping society. ",
  "Image": "nleal.png",
  "Designation": "Management Consultant, EY"
  },
  {
  "Name": "Pawan Tripathi",
  "Bio": "Pawan Tripathi is a Principal engineer at Comcast with over 11 years of IT experience. He holds a Bachelor’s degree in Computer Science from Mumbai University. Engaged with Comcast since 2011, he works as a full stack developer and leads reference client development for Android and iOS platforms. He strives to become a polyglot in Programming and Natural Languages, and is versed in Golang, Java, Swift, English and Hindi. Currently, he indulges in Urdu poetry.",
  "Image": "ptripathi.png",
  "Designation": "Principal Engineer, Comcast"
  },
  {
  "Name": "Preethi Bojja",
  "Bio": "Preethi Bojja is Sr. Data Scientist at EBI, Comcast. She has 5 years of hands-on industrial experience with expertise in data driven ML solutions. In her current role, she has worked on risk modeling, unsupervised clustering and AI methods. She has master’s degree from Georgia State University, specialized in Data Mining and Analytics. Prior to joining Comcast, Preethi worked with Volvo Groups IHG and Cognizant. She is tech-enthusiast and has done projects on NLP, social-media analysis. Preethi is also President of Toastmasters club at Comcast HQ.",
  "Image": "pbojja.png",
  "Designation": "Sr. Data Scientist at EBI, Comcast"
  },
  {
  "Name": "Rebecca L. Rakoski, Esquire",
  "Bio": "Rebecca L. Rakoski is the co-founder and managing partner at XPAN Law Group, a boutique law firm focusing exclusively on all aspects of the law that involve the transfer and sharing of data, including electronic discovery, cybersecurity and data privacy. Rebecca uniquely understands how technology intersects with the legal requirements, obligations and liabilities related to data transfer. She understands cross border data transfer issues related to international data privacy regulations in the European Union, Asia, South America and Australia. Rebecca can navigate the complexities of different state and federal regulations that affect the transfer, storage and collection of data.",
  "Image": "rrakoski.png",
  "Designation": "Co-Founder and Managing Partner, XPAN Law Group, LLC"
  },
  {
  "Name": "Reshma Moorthy",
  "Bio": "Reshma Moorthy is the innovator at Frontier. She specializes in driving organizational change, increasing profitability exponentially through tech innovation and disruptive partnerships, and leading teams charismatically to achieve results. Always on the cusp of IT evolutions, Reshma leverages her 10+ years of award-winning technology thought leadership and experiences to orchestrate strategic technology initiatives and develop new products and practices. A strong proponent of diversity and inclusion, Reshma serves as Chair of the EMSDC’s Minority Business Input Committee. She holds a B.S. degree in Biology and Health Sciences from St. Joseph's University and earned higher education degrees from Tuck and Kelloggs Executive Business Programs.",
  "Image": "rmoorthy.png",
  "Designation": "President & CEO, Frontier Technologies"
  },
  {
      "Name": "Sandra Wenzel",
      "Bio": "Sandy Wenzel is a Consulting Engineer for Palo Alto Networks, where she has worked for the past three years. ‘The Next Generation Firewall’ was branded at Palo Alto Networks in the 2000s and they’ve been highly disruptive ever since. You may know Sandy from such talk tracks as 'Purple Teaming with Passion' and 'Let’s Talk Risk: A Guide to Understanding Your Over Byte.' She speaks through pop-culture references, is multilingual in network operating systems and is an introvert who knows there is no place like 127.0.0.1 or ::1.",
      "Image": "swenzel.png",
      "Designation": "Consulting Engineer, Palo Alto Networks"
  },
  {
      "Name": "Sridhar Alla",
      "Bio": "Sridhar Alla is the co-founder and CTO of Bluewhale.one, which addresses one of the key problems impacting the retail industry using AI.  He has deep expertise in building AI-driven Big Data Analytical practices on public cloud as well as in-house infrastructure. Prior to his new startup, Sridhar worked in Comcast building Business Intelligence Solutions. He is a published author of two books and an avid presenter at numerous Strata, Hadoop World, Spark Summit and other conferences. Sridhar also has several patents filed with the U.S. PTO on large scale computing and distributed systems.",
      "Image": "salla.png",
      "Designation": "Co-Founder & CTO, Blue Whale"
  },
  {
      "Name": "Teresa Talase",
      "Bio": "Teresa Talese is an Executive Director, EBI Stewardship and has been with Comcast for 11 years. In her current role, she leads the Stewardship organization within the Data Management umbrella focusing on Enterprise data, cross partnership and collaboration amongst business units and technology teams. Teresa is a mentor through Comcast's Mentorship Employee Resource Group and a WICT Greater Philadelphia Chapter Board member currently serving as the Tech It Out Director. Teresa enjoys spending time with her husband and two children. They enjoy going out to eat, taking walks and traveling. Teresa also enjoys partnering with her husband with business decisions and planning for their restaurants and pizzerias.",
      "Image": "ttalase.png",
      "Designation": "Co-Director WICT Tech It Out, Executive Director, Comcast"
  },
  {
      "Name": "Whitney Behm",
      "Bio": "Whitney Behm is the Manager for Talent, Technology at Comcast. In her role, Whitney oversees technical recruiting across the Business Units that comprise the Sales & Growth Talent Acquisition organization at Comcast. Whitney joined Comcast in 2016 in a technical recruiting role supporting the FreeWheel, Blockgraph, Advanced Advertising and Visible World teams. Prior to joining Comcast, Whitney was a Talent Acquisition Consultant at Johnson & Johnson and a Technical Recruiter/Account Manager at Brooksource. She holds a B.A. from the University of Colorado at Boulder and an M.B.A. from the University of Denver. She is the Co-Director for the WICT Philadelphia Mentorship Program and is the Co-Lead for Comcast’s Young Professional Network at HQ.",
      "Image": "wbehm.png",
      "Designation": "Manager for Talent, Comcast"
  }
  ]
